# TextureRealWorldOffsetY Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Wave..::..TextureRealWorldOffsetY Property
Wave Class See Also
---
The property labeled "Offset Y" from the "Wave" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string TextureRealWorldOffsetY { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TextureRealWorldOffsetY As String
	Get
```

Visual C++
---
```text
public:
static property String^ TextureRealWorldOffsetY {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyDistance".
# See Also
Wave Class
Autodesk.Revit.DB.Visual Namespace